In [1]:
# Import libraries
import numpy as np
import pandas as pd

In [2]:
# Create 3 different series
s1 = pd.Series(np.random.randint(low=1, high=4, size=(100,)))
s1.head()

0    3
1    1
2    2
3    1
4    2
dtype: int32

In [3]:
s2 = pd.Series(np.random.randint(low=1, high=3, size=(100,)))
s2.head()

0    1
1    1
2    1
3    1
4    1
dtype: int32

In [4]:
s3 = pd.Series(np.random.randint(low=10000, high=30000, size=(100,)))
s3.head()

0    26717
1    28138
2    24906
3    29906
4    22698
dtype: int32

In [5]:
# Dataframe of joined series
df = pd.DataFrame({"s1":s1, "s2":s2, "s3":s3})
df.head()

   s1  s2     s3
0   3   1  26717
1   1   1  28138
2   2   1  24906
3   1   1  29906
4   2   1  22698

In [6]:
# Change dataframe column names
df.rename(columns = {"s1":"bedrs", "s2":"bathrs", "s3":"price_sqr_meter"}, inplace = True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            26717
1      1       1            28138
2      2       1            24906
3      1       1            29906
4      2       1            22698

In [7]:
# Create one column dataframe
df2 = pd.DataFrame({"bigcolumn": pd.concat([s1, s2, s3])})
df2.head()

   bigcolumn
0          3
1          1
2          2
3          1
4          2

In [8]:
# View index
df2.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

In [9]:
# Re-index
df2.index = pd.RangeIndex(len(df2.index))
df2.index = range(len(df2.index))
df2.head()

   bigcolumn
0          3
1          1
2          2
3          1
4          2

In [10]:
df2.index

RangeIndex(start=0, stop=300, step=1)